#############################################################
############# Clock and Reset constraints ###################
#############################################################

# Sometime after Vivado 2020, it became impossible to rename an autogenerated clock,
# because it doesn't find pins inside of the OOC MMCM (this makes sense), nor does it
# find the pins of the MMCM instantiation (this does not make sense...). You get a warning
# during synthesis/implementation, but opening the design it renames it in report_clocks...
# Instead, to use in XDC files, use get_clocks -of_objects [get_pins mmcm/clk_logic]
# create_generated_clock -name abcd [get_pins mmcm/clk_logic]
# create_generated_clock -name abcd [mmcm/inst/mmcm_adv_inst/CLKOUT0]

# The external reset signal is asynchronous (mechanical button press), so do not check setup/hold times
set_false_path -from [get_ports cpu_resetn]

#############################################################
################# IO pin constraints ########################
#############################################################

# LED timings are not important, so leave fully unconstrained
set_false_path -to [get_ports led[*]]

# set_output_delay -clock [get_clocks clk_logic] -min -add_delay 0.000 [get_ports {led[*]}]
# set_output_delay -clock [get_clocks clk_logic] -max -add_delay 5.000 [get_ports {led[*]}]
